3【程序设计】
--------------------------------------------------

功能：从字符串s中删除指定的字符c。

-------------------------------------------------*/

#include <stdio.h>

fun(char s[],char c)
{
/**********Program**********/
 int i,j=0;
	for(i=0;i<100;i++)
		if(s[i]==c)
		{
			s[i]=s[i+1];
			j++;
		}
 
  
  
  
  
  
/**********  End  **********/
}

void main()
{
        static char str[]="turbo c and borland c++";
        char c='a';
        fun(str,c);
        printf("str=%s\n",str);
}
/*-------------------------------------------------------
