4【程序设计】
---------------------------------------------------------

题目：编写函数fun，其功能是：将两个两位数的正整数a、b合并成一个整数放在c中。
      合并的方式是：将a数的十位和个位数依次在c数的个位和百位上，b数的十位和
      个位数依次放在c数的十位和千位上。

例如：当a＝45，b＝12时，调用该函数后c＝2514。

注意：请勿动改主函数的main和其它函数中的任何内容，仅在函数fun的花括号填入
      你编写的若干语句。

-------------------------------------------------------*/

#include <stdio.h>

void fun(int a, int b, long *c)
{
/**********Program**********/
Int d ,f，m,n;
d=a%10;
f=b%10;
m=a/10;
n=b/10;
*c=1000*f+100*d+10*n+m;




/**********  End  **********/
}
void main()
{  
        int a,b; long c;
        printf("Input a, b:");
        scanf("%d %d", &a, &b);
        fun(a, b, &c);
        printf("The result is: %ld\n", c);
}
/*-------------------------------------------------------
